# Introducción práctica a SQL

## Introducción
* Del inglés _Structured Query Language_.
* Lenguaje más extendido para consultar y manipular Bases de datos relacionales.
* SQL es un lenguaje estándar. No obstante, existen gran cantidad de _dialectos_.

## Usos
* Consulta de datos.
* Manipulación de datos (Inserción, modificación, eliminación).
* Definición de datos (Tablas, Índices, Vistas, ...).
* Configuración de seguridad (Usuarios, permisos, ...).
* ...

## Configuración del entorno

In [179]:
%load_ext sql
%sql mysql+pymysql://example:example@mysql/example

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

Connecting and switching to connection 'mysql+pymysql://example:***@mysql/example'

In [180]:
%%sql
DROP TABLE IF EXISTS Empleados;
DROP TABLE IF EXISTS Departamentos;

CREATE TABLE Departamentos
       (id TINYINT,
        nombre VARCHAR(14),
        ciudad VARCHAR(13),
        PRIMARY KEY(id));

INSERT INTO Departamentos VALUES (10,'Contabilidad','Nueva York');
INSERT INTO Departamentos VALUES (20,'Investigacion','Dallas');
INSERT INTO Departamentos VALUES (30,'Ventas','Chicago');
INSERT INTO Departamentos VALUES (40,'Operaciones','Boston');

CREATE TABLE Empleados
       (id INT NOT NULL,
        nombre VARCHAR(10),
        empleo VARCHAR(9),
        jefe INT,
        fecha_entrada DATE,
        sueldo FLOAT,
        complemento FLOAT,
        departamento_id TINYINT,
        PRIMARY KEY(id),
        FOREIGN KEY (departamento_id) REFERENCES Departamentos(id) );

INSERT INTO Empleados VALUES
        (7369,'Smith','Ordenanza',7902,'2000-12-17',800,NULL,20);
INSERT INTO Empleados VALUES
        (7499,'Allen','Vendedor',7698,'2001-02-20',1600,300,30);
INSERT INTO Empleados VALUES
        (7521,'Ward','Vendedor',7698,'2001-02-22',1250,500,30);
INSERT INTO Empleados VALUES
        (7566,'Jones','Directivo',7839,'2001-04-02',2975,NULL,20);
INSERT INTO Empleados VALUES
        (7654,'Martin','Vendedor',7698,'2001-09-28',1250,1400,30);
INSERT INTO Empleados VALUES
        (7698,'Blake','Directivo',7839,'2001-05-01',2850,NULL,30);
INSERT INTO Empleados VALUES
        (7782,'Clark','Directivo',7839,'2001-06-09',2450,NULL,10);
INSERT INTO Empleados VALUES
        (7788,'Scott','Analista',7566,'2002-12-09',3000,NULL,20);
INSERT INTO Empleados VALUES
        (7839,'King','Director',NULL,'2001-11-17',5000,NULL,10);
INSERT INTO Empleados VALUES
        (7844,'Turner','Vendedor',7698,'2001-09-08',1500,0,30);
INSERT INTO Empleados VALUES
        (7876,'Adams','Ordenanza',7788,'2003-01-12',1100,NULL,20);
INSERT INTO Empleados VALUES
        (7900,'James','Ordenanza',7698,'2001-12-03',950,NULL,30);
INSERT INTO Empleados VALUES
        (7902,'Ford','Analista',7566,'2001-12-03',3000,NULL,20);
INSERT INTO Empleados VALUES
        (7934,'Miller','Ordenanza',7782,'2002-01-23',1300,NULL,10);

Running query in 'mysql+pymysql://example:***@mysql/example'

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

++
||
++
++

## Sintaxis básica

```sql
SELECT COLUMNAS_SEPARADAS_POR_COMAS
FROM TABLA
WHERE CONDICION;
```

## Operaciones de consulta sencillas para el filtrado de filas y columnas

Ejemplo. Mostrar todos los empleados

In [181]:
%%sql
SELECT * 
FROM Empleados;

Running query in 'mysql+pymysql://example:***@mysql/example'

14 rows affected.

+------+--------+-----------+------+---------------+--------+-------------+-----------------+
|  id  | nombre |   empleo  | jefe | fecha_entrada | sueldo | complemento | departamento_id |
+------+--------+-----------+------+---------------+--------+-------------+-----------------+
| 7369 | Smith  | Ordenanza | 7902 |   2000-12-17  | 800.0  |     None    |        20       |
| 7499 | Allen  |  Vendedor | 7698 |   2001-02-20  | 1600.0 |    300.0    |        30       |
| 7521 |  Ward  |  Vendedor | 7698 |   2001-02-22  | 1250.0 |    500.0    |        30       |
| 7566 | Jones  | Directivo | 7839 |   2001-04-02  | 2975.0 |     None    |        20       |
| 7654 | Martin |  Vendedor | 7698 |   2001-09-28  | 1250.0 |    1400.0   |        30       |
| 7698 | Blake  | Directivo | 7839 |   2001-05-01  | 2850.0 |     None    |        30       |
| 7782 | Clark  | Directivo | 7839 |   2001-06-09  | 2450.0 |     None    |        10       |
| 7788 | Scott  |  Analista | 7566 |   2002-12-09  | 3000.0 |     None    |        20       |
| 7839 |  King  |  Director | None |   2001-11-17  | 5000.0 |     None    |        10       |
| 7844 | Turner |  Vendedor | 7698 |   2001-09-08  | 1500.0 |     0.0     |        30       |
+------+--------+-----------+------+---------------+--------+-------------+-----------------+
Truncated to displaylimit of 10.

Ejemplo. Mostrar las filas de todos los empleados con empleo _Vendedor_

In [182]:
%%sql
SELECT * 
FROM Empleados
WHERE empleo = 'Vendedor';

Running query in 'mysql+pymysql://example:***@mysql/example'

4 rows affected.

+------+--------+----------+------+---------------+--------+-------------+-----------------+
|  id  | nombre |  empleo  | jefe | fecha_entrada | sueldo | complemento | departamento_id |
+------+--------+----------+------+---------------+--------+-------------+-----------------+
| 7499 | Allen  | Vendedor | 7698 |   2001-02-20  | 1600.0 |    300.0    |        30       |
| 7521 |  Ward  | Vendedor | 7698 |   2001-02-22  | 1250.0 |    500.0    |        30       |
| 7654 | Martin | Vendedor | 7698 |   2001-09-28  | 1250.0 |    1400.0   |        30       |
| 7844 | Turner | Vendedor | 7698 |   2001-09-08  | 1500.0 |     0.0     |        30       |
+------+--------+----------+------+---------------+--------+-------------+-----------------+

Ejemplo. Mostrar el nombre, empleo y sueldo de todos los empleados

In [183]:
%%sql
SELECT nombre, empleo, sueldo
FROM Empleados;

Running query in 'mysql+pymysql://example:***@mysql/example'

14 rows affected.

+--------+-----------+--------+
| nombre |   empleo  | sueldo |
+--------+-----------+--------+
| Smith  | Ordenanza | 800.0  |
| Allen  |  Vendedor | 1600.0 |
|  Ward  |  Vendedor | 1250.0 |
| Jones  | Directivo | 2975.0 |
| Martin |  Vendedor | 1250.0 |
| Blake  | Directivo | 2850.0 |
| Clark  | Directivo | 2450.0 |
| Scott  |  Analista | 3000.0 |
|  King  |  Director | 5000.0 |
| Turner |  Vendedor | 1500.0 |
+--------+-----------+--------+
Truncated to displaylimit of 10.

## Consultas con varias condiciones

### El operador lógico AND

Ejemplo. Mostrar las filas de todos los empleados con empleo _Vendedor_ y complemento de al menos 500 EUR

In [184]:
%%sql
SELECT *
FROM Empleados
WHERE empleo = 'Vendedor' AND complemento >= 500;

Running query in 'mysql+pymysql://example:***@mysql/example'

2 rows affected.

+------+--------+----------+------+---------------+--------+-------------+-----------------+
|  id  | nombre |  empleo  | jefe | fecha_entrada | sueldo | complemento | departamento_id |
+------+--------+----------+------+---------------+--------+-------------+-----------------+
| 7521 |  Ward  | Vendedor | 7698 |   2001-02-22  | 1250.0 |    500.0    |        30       |
| 7654 | Martin | Vendedor | 7698 |   2001-09-28  | 1250.0 |    1400.0   |        30       |
+------+--------+----------+------+---------------+--------+-------------+-----------------+

Ejemplo. Mostrar el nombre, empleo y sueldo de todos los empleados con empleo _Vendedor_ y complemento de al menos 500 EUR

In [185]:
%%sql
SELECT nombre, empleo, sueldo
FROM Empleados
WHERE empleo = 'Vendedor' AND complemento >= 500;

Running query in 'mysql+pymysql://example:***@mysql/example'

2 rows affected.

+--------+----------+--------+
| nombre |  empleo  | sueldo |
+--------+----------+--------+
|  Ward  | Vendedor | 1250.0 |
| Martin | Vendedor | 1250.0 |
+--------+----------+--------+

### El operador lógico OR

Ejemplo. Mostrar todas las filas de los empleados que tengan empleo de Vendedor, Directivo u Ordenanza

In [186]:
%%sql
SELECT *
FROM Empleados
WHERE empleo = 'Vendedor' OR empleo = 'Directivo' OR empleo = 'Ordenanza';

Running query in 'mysql+pymysql://example:***@mysql/example'

11 rows affected.

+------+--------+-----------+------+---------------+--------+-------------+-----------------+
|  id  | nombre |   empleo  | jefe | fecha_entrada | sueldo | complemento | departamento_id |
+------+--------+-----------+------+---------------+--------+-------------+-----------------+
| 7369 | Smith  | Ordenanza | 7902 |   2000-12-17  | 800.0  |     None    |        20       |
| 7499 | Allen  |  Vendedor | 7698 |   2001-02-20  | 1600.0 |    300.0    |        30       |
| 7521 |  Ward  |  Vendedor | 7698 |   2001-02-22  | 1250.0 |    500.0    |        30       |
| 7566 | Jones  | Directivo | 7839 |   2001-04-02  | 2975.0 |     None    |        20       |
| 7654 | Martin |  Vendedor | 7698 |   2001-09-28  | 1250.0 |    1400.0   |        30       |
| 7698 | Blake  | Directivo | 7839 |   2001-05-01  | 2850.0 |     None    |        30       |
| 7782 | Clark  | Directivo | 7839 |   2001-06-09  | 2450.0 |     None    |        10       |
| 7844 | Turner |  Vendedor | 7698 |   2001-09-08  | 1500.0 |     0.0     |        30       |
| 7876 | Adams  | Ordenanza | 7788 |   2003-01-12  | 1100.0 |     None    |        20       |
| 7900 | James  | Ordenanza | 7698 |   2001-12-03  | 950.0  |     None    |        30       |
+------+--------+-----------+------+---------------+--------+-------------+-----------------+
Truncated to displaylimit of 10.

### El operador lógico IN y búsqueda aproximada

Ejemplo. Uso del operador IN para mostrar todas las filas de los empleados que tengan empleo de Vendedor, Directivo u Ordenanza

In [187]:
%%sql
SELECT *
FROM Empleados
WHERE empleo IN ('Vendedor', 'Directivo', 'Ordenanza');

Running query in 'mysql+pymysql://example:***@mysql/example'

11 rows affected.

+------+--------+-----------+------+---------------+--------+-------------+-----------------+
|  id  | nombre |   empleo  | jefe | fecha_entrada | sueldo | complemento | departamento_id |
+------+--------+-----------+------+---------------+--------+-------------+-----------------+
| 7369 | Smith  | Ordenanza | 7902 |   2000-12-17  | 800.0  |     None    |        20       |
| 7499 | Allen  |  Vendedor | 7698 |   2001-02-20  | 1600.0 |    300.0    |        30       |
| 7521 |  Ward  |  Vendedor | 7698 |   2001-02-22  | 1250.0 |    500.0    |        30       |
| 7566 | Jones  | Directivo | 7839 |   2001-04-02  | 2975.0 |     None    |        20       |
| 7654 | Martin |  Vendedor | 7698 |   2001-09-28  | 1250.0 |    1400.0   |        30       |
| 7698 | Blake  | Directivo | 7839 |   2001-05-01  | 2850.0 |     None    |        30       |
| 7782 | Clark  | Directivo | 7839 |   2001-06-09  | 2450.0 |     None    |        10       |
| 7844 | Turner |  Vendedor | 7698 |   2001-09-08  | 1500.0 |     0.0     |        30       |
| 7876 | Adams  | Ordenanza | 7788 |   2003-01-12  | 1100.0 |     None    |        20       |
| 7900 | James  | Ordenanza | 7698 |   2001-12-03  | 950.0  |     None    |        30       |
+------+--------+-----------+------+---------------+--------+-------------+-----------------+
Truncated to displaylimit of 10.

Ejemplo. Mostrar todas las filas de los empleados que no tienen como empleo Vendedor, Directivo u Ordenanza

In [188]:
%%sql
SELECT *
FROM Empleados
WHERE empleo NOT IN ('Vendedor', 'Directivo', 'Ordenanza');

Running query in 'mysql+pymysql://example:***@mysql/example'

3 rows affected.

+------+--------+----------+------+---------------+--------+-------------+-----------------+
|  id  | nombre |  empleo  | jefe | fecha_entrada | sueldo | complemento | departamento_id |
+------+--------+----------+------+---------------+--------+-------------+-----------------+
| 7788 | Scott  | Analista | 7566 |   2002-12-09  | 3000.0 |     None    |        20       |
| 7839 |  King  | Director | None |   2001-11-17  | 5000.0 |     None    |        10       |
| 7902 |  Ford  | Analista | 7566 |   2001-12-03  | 3000.0 |     None    |        20       |
+------+--------+----------+------+---------------+--------+-------------+-----------------+

Ejemplo. Mostrar todas las filas de los empleados que tienen algún empleo de dirección

In [189]:
%%sql
SELECT *
FROM Empleados
WHERE empleo LIKE '%Director%';

Running query in 'mysql+pymysql://example:***@mysql/example'

1 rows affected.

+------+--------+----------+------+---------------+--------+-------------+-----------------+
|  id  | nombre |  empleo  | jefe | fecha_entrada | sueldo | complemento | departamento_id |
+------+--------+----------+------+---------------+--------+-------------+-----------------+
| 7839 |  King  | Director | None |   2001-11-17  | 5000.0 |     None    |        10       |
+------+--------+----------+------+---------------+--------+-------------+-----------------+

### Manejo de nulos

Ejemplo. Mostrar las filas de todos los empleados que no tienen datos de complemento

In [190]:
%%sql
SELECT *
FROM Empleados
WHERE complemento IS NULL;

Running query in 'mysql+pymysql://example:***@mysql/example'

10 rows affected.

+------+--------+-----------+------+---------------+--------+-------------+-----------------+
|  id  | nombre |   empleo  | jefe | fecha_entrada | sueldo | complemento | departamento_id |
+------+--------+-----------+------+---------------+--------+-------------+-----------------+
| 7369 | Smith  | Ordenanza | 7902 |   2000-12-17  | 800.0  |     None    |        20       |
| 7566 | Jones  | Directivo | 7839 |   2001-04-02  | 2975.0 |     None    |        20       |
| 7698 | Blake  | Directivo | 7839 |   2001-05-01  | 2850.0 |     None    |        30       |
| 7782 | Clark  | Directivo | 7839 |   2001-06-09  | 2450.0 |     None    |        10       |
| 7788 | Scott  |  Analista | 7566 |   2002-12-09  | 3000.0 |     None    |        20       |
| 7839 |  King  |  Director | None |   2001-11-17  | 5000.0 |     None    |        10       |
| 7876 | Adams  | Ordenanza | 7788 |   2003-01-12  | 1100.0 |     None    |        20       |
| 7900 | James  | Ordenanza | 7698 |   2001-12-03  | 950.0  |     None    |        30       |
| 7902 |  Ford  |  Analista | 7566 |   2001-12-03  | 3000.0 |     None    |        20       |
| 7934 | Miller | Ordenanza | 7782 |   2002-01-23  | 1300.0 |     None    |        10       |
+------+--------+-----------+------+---------------+--------+-------------+-----------------+
Truncated to displaylimit of 10.

Ejemplo. Mostrar las filas de todos los empleados que tienen datos de complemento

In [191]:
%%sql
SELECT *
FROM Empleados
WHERE complemento IS NOT NULL;

Running query in 'mysql+pymysql://example:***@mysql/example'

4 rows affected.

+------+--------+----------+------+---------------+--------+-------------+-----------------+
|  id  | nombre |  empleo  | jefe | fecha_entrada | sueldo | complemento | departamento_id |
+------+--------+----------+------+---------------+--------+-------------+-----------------+
| 7499 | Allen  | Vendedor | 7698 |   2001-02-20  | 1600.0 |    300.0    |        30       |
| 7521 |  Ward  | Vendedor | 7698 |   2001-02-22  | 1250.0 |    500.0    |        30       |
| 7654 | Martin | Vendedor | 7698 |   2001-09-28  | 1250.0 |    1400.0   |        30       |
| 7844 | Turner | Vendedor | 7698 |   2001-09-08  | 1500.0 |     0.0     |        30       |
+------+--------+----------+------+---------------+--------+-------------+-----------------+

### Consultas de un rango de valores

Ejemplo. Mostrar las filas de todos los empleados que tienen sueldo mayor o igual que 2000 y menor o igual que 3000

In [192]:
%%sql
SELECT *
FROM Empleados
WHERE sueldo >= 2000 AND sueldo <= 3000;

Running query in 'mysql+pymysql://example:***@mysql/example'

5 rows affected.

+------+--------+-----------+------+---------------+--------+-------------+-----------------+
|  id  | nombre |   empleo  | jefe | fecha_entrada | sueldo | complemento | departamento_id |
+------+--------+-----------+------+---------------+--------+-------------+-----------------+
| 7566 | Jones  | Directivo | 7839 |   2001-04-02  | 2975.0 |     None    |        20       |
| 7698 | Blake  | Directivo | 7839 |   2001-05-01  | 2850.0 |     None    |        30       |
| 7782 | Clark  | Directivo | 7839 |   2001-06-09  | 2450.0 |     None    |        10       |
| 7788 | Scott  |  Analista | 7566 |   2002-12-09  | 3000.0 |     None    |        20       |
| 7902 |  Ford  |  Analista | 7566 |   2001-12-03  | 3000.0 |     None    |        20       |
+------+--------+-----------+------+---------------+--------+-------------+-----------------+

Ejemplo. Mostrar las filas de todos los empleados que tienen el sueldo comprendido entre 2000 y 3000

In [193]:
%%sql
SELECT *
FROM Empleados
WHERE sueldo BETWEEN 2000 AND 3000;

Running query in 'mysql+pymysql://example:***@mysql/example'

5 rows affected.

+------+--------+-----------+------+---------------+--------+-------------+-----------------+
|  id  | nombre |   empleo  | jefe | fecha_entrada | sueldo | complemento | departamento_id |
+------+--------+-----------+------+---------------+--------+-------------+-----------------+
| 7566 | Jones  | Directivo | 7839 |   2001-04-02  | 2975.0 |     None    |        20       |
| 7698 | Blake  | Directivo | 7839 |   2001-05-01  | 2850.0 |     None    |        30       |
| 7782 | Clark  | Directivo | 7839 |   2001-06-09  | 2450.0 |     None    |        10       |
| 7788 | Scott  |  Analista | 7566 |   2002-12-09  | 3000.0 |     None    |        20       |
| 7902 |  Ford  |  Analista | 7566 |   2001-12-03  | 3000.0 |     None    |        20       |
+------+--------+-----------+------+---------------+--------+-------------+-----------------+

### Uso de expresiones en SELECT

Ejemplo. Mostrar nombre y la suma de sueldo y complemento de todos los empleados

In [194]:
%%sql
SELECT nombre, (sueldo + complemento) AS sueldo_total
FROM Empleados;

Running query in 'mysql+pymysql://example:***@mysql/example'

14 rows affected.

+--------+--------------+
| nombre | sueldo_total |
+--------+--------------+
| Smith  |     None     |
| Allen  |    1900.0    |
|  Ward  |    1750.0    |
| Jones  |     None     |
| Martin |    2650.0    |
| Blake  |     None     |
| Clark  |     None     |
| Scott  |     None     |
|  King  |     None     |
| Turner |    1500.0    |
+--------+--------------+
Truncated to displaylimit of 10.

:::{warning}
La aparición de un valor NULL en una operación aritmética hace que el resultado sea NULL. Por ejemplo, `NULL + valor = NULL`
:::

Ejemplo. Mostrar nombre, sueldo, complemento, sueldo y complemento de todos los empleados

In [195]:
%%sql
SELECT nombre, sueldo, complemento, (sueldo + complemento) AS sueldo_total
FROM Empleados;

Running query in 'mysql+pymysql://example:***@mysql/example'

14 rows affected.

+--------+--------+-------------+--------------+
| nombre | sueldo | complemento | sueldo_total |
+--------+--------+-------------+--------------+
| Smith  | 800.0  |     None    |     None     |
| Allen  | 1600.0 |    300.0    |    1900.0    |
|  Ward  | 1250.0 |    500.0    |    1750.0    |
| Jones  | 2975.0 |     None    |     None     |
| Martin | 1250.0 |    1400.0   |    2650.0    |
| Blake  | 2850.0 |     None    |     None     |
| Clark  | 2450.0 |     None    |     None     |
| Scott  | 3000.0 |     None    |     None     |
|  King  | 5000.0 |     None    |     None     |
| Turner | 1500.0 |     0.0     |    1500.0    |
+--------+--------+-------------+--------------+
Truncated to displaylimit of 10.

:::{note}
`COALESCE` es una función que permite asociar un valor a una columna cuando es `NULL`. Por ejemplo, `COALESCE(complemento, 0)` indica que `complemento` tome el valor `0` cuando tenga un valor de `NULL`.
:::

Ejemplo. Mostrar nombre, sueldo, complemento, sueldo y complemento de todos los empleados considerando como 0 los complementos nulos

In [196]:
%%sql
SELECT nombre, sueldo, complemento, (sueldo + COALESCE(complemento, 0)) AS sueldo_total
FROM Empleados;

Running query in 'mysql+pymysql://example:***@mysql/example'

14 rows affected.

+--------+--------+-------------+--------------+
| nombre | sueldo | complemento | sueldo_total |
+--------+--------+-------------+--------------+
| Smith  | 800.0  |     None    |    800.0     |
| Allen  | 1600.0 |    300.0    |    1900.0    |
|  Ward  | 1250.0 |    500.0    |    1750.0    |
| Jones  | 2975.0 |     None    |    2975.0    |
| Martin | 1250.0 |    1400.0   |    2650.0    |
| Blake  | 2850.0 |     None    |    2850.0    |
| Clark  | 2450.0 |     None    |    2450.0    |
| Scott  | 3000.0 |     None    |    3000.0    |
|  King  | 5000.0 |     None    |    5000.0    |
| Turner | 1500.0 |     0.0     |    1500.0    |
+--------+--------+-------------+--------------+
Truncated to displaylimit of 10.

### Renombrado de columnas

Ejemplo. Mostrar nombre, sueldo, complemento y sueldo total de todos los empleados considerando como 0 los complementos nulos.

In [197]:
%%sql
SELECT nombre, sueldo, complemento, (sueldo + COALESCE(complemento, 0)) AS sueldo_total
FROM Empleados;

Running query in 'mysql+pymysql://example:***@mysql/example'

14 rows affected.

+--------+--------+-------------+--------------+
| nombre | sueldo | complemento | sueldo_total |
+--------+--------+-------------+--------------+
| Smith  | 800.0  |     None    |    800.0     |
| Allen  | 1600.0 |    300.0    |    1900.0    |
|  Ward  | 1250.0 |    500.0    |    1750.0    |
| Jones  | 2975.0 |     None    |    2975.0    |
| Martin | 1250.0 |    1400.0   |    2650.0    |
| Blake  | 2850.0 |     None    |    2850.0    |
| Clark  | 2450.0 |     None    |    2450.0    |
| Scott  | 3000.0 |     None    |    3000.0    |
|  King  | 5000.0 |     None    |    5000.0    |
| Turner | 1500.0 |     0.0     |    1500.0    |
+--------+--------+-------------+--------------+
Truncated to displaylimit of 10.

## Manejo de fechas

Ejemplo. Mostrar todas las filas de los empleados que se incorporaron a partir del 1 de enero de 2002

In [198]:
%%sql
SELECT *
FROM Empleados
WHERE fecha_entrada >= '2002-01-01';

Running query in 'mysql+pymysql://example:***@mysql/example'

3 rows affected.

+------+--------+-----------+------+---------------+--------+-------------+-----------------+
|  id  | nombre |   empleo  | jefe | fecha_entrada | sueldo | complemento | departamento_id |
+------+--------+-----------+------+---------------+--------+-------------+-----------------+
| 7788 | Scott  |  Analista | 7566 |   2002-12-09  | 3000.0 |     None    |        20       |
| 7876 | Adams  | Ordenanza | 7788 |   2003-01-12  | 1100.0 |     None    |        20       |
| 7934 | Miller | Ordenanza | 7782 |   2002-01-23  | 1300.0 |     None    |        10       |
+------+--------+-----------+------+---------------+--------+-------------+-----------------+

### Funciones para el manejo de fechas

:::{note}
La función `YEAR()` aplicada a una fecha devuelve el año de la fecha en formato numérico.
:::

Ejemplo. Mostrar todas las filas de los empleados cuya fecha de entrada no sea del año 2000

In [199]:
%%sql
SELECT *
FROM Empleados
WHERE YEAR(fecha_entrada) <> 2000;

Running query in 'mysql+pymysql://example:***@mysql/example'

13 rows affected.

+------+--------+-----------+------+---------------+--------+-------------+-----------------+
|  id  | nombre |   empleo  | jefe | fecha_entrada | sueldo | complemento | departamento_id |
+------+--------+-----------+------+---------------+--------+-------------+-----------------+
| 7499 | Allen  |  Vendedor | 7698 |   2001-02-20  | 1600.0 |    300.0    |        30       |
| 7521 |  Ward  |  Vendedor | 7698 |   2001-02-22  | 1250.0 |    500.0    |        30       |
| 7566 | Jones  | Directivo | 7839 |   2001-04-02  | 2975.0 |     None    |        20       |
| 7654 | Martin |  Vendedor | 7698 |   2001-09-28  | 1250.0 |    1400.0   |        30       |
| 7698 | Blake  | Directivo | 7839 |   2001-05-01  | 2850.0 |     None    |        30       |
| 7782 | Clark  | Directivo | 7839 |   2001-06-09  | 2450.0 |     None    |        10       |
| 7788 | Scott  |  Analista | 7566 |   2002-12-09  | 3000.0 |     None    |        20       |
| 7839 |  King  |  Director | None |   2001-11-17  | 5000.0 |     None    |        10       |
| 7844 | Turner |  Vendedor | 7698 |   2001-09-08  | 1500.0 |     0.0     |        30       |
| 7876 | Adams  | Ordenanza | 7788 |   2003-01-12  | 1100.0 |     None    |        20       |
+------+--------+-----------+------+---------------+--------+-------------+-----------------+
Truncated to displaylimit of 10.

Ejemplo. Mostrar todas las filas de los empleados cuya fecha de entrada no sea del año 2000 ni 2001

In [200]:
%%sql
SELECT *
FROM Empleados
WHERE YEAR(fecha_entrada) NOT IN (2000, 2001);

Running query in 'mysql+pymysql://example:***@mysql/example'

3 rows affected.

+------+--------+-----------+------+---------------+--------+-------------+-----------------+
|  id  | nombre |   empleo  | jefe | fecha_entrada | sueldo | complemento | departamento_id |
+------+--------+-----------+------+---------------+--------+-------------+-----------------+
| 7788 | Scott  |  Analista | 7566 |   2002-12-09  | 3000.0 |     None    |        20       |
| 7876 | Adams  | Ordenanza | 7788 |   2003-01-12  | 1100.0 |     None    |        20       |
| 7934 | Miller | Ordenanza | 7782 |   2002-01-23  | 1300.0 |     None    |        10       |
+------+--------+-----------+------+---------------+--------+-------------+-----------------+

:::{note}
La función `CURDATE()` devuelve la fecha actual.
:::

Ejemplo. Mostrar nombre, empleo, fecha actual, fecha de entrada y diferencia entre fecha actual y fecha de entrada

In [201]:
%%sql
SELECT nombre, empleo, CURDATE() AS fechaActual, fecha_entrada, DATEDIFF(CURDATE(), fecha_entrada) AS antiguedad
FROM Empleados;

Running query in 'mysql+pymysql://example:***@mysql/example'

14 rows affected.

+--------+-----------+-------------+---------------+------------+
| nombre |   empleo  | fechaActual | fecha_entrada | antiguedad |
+--------+-----------+-------------+---------------+------------+
| Smith  | Ordenanza |  2025-03-18 |   2000-12-17  |    8857    |
| Allen  |  Vendedor |  2025-03-18 |   2001-02-20  |    8792    |
|  Ward  |  Vendedor |  2025-03-18 |   2001-02-22  |    8790    |
| Jones  | Directivo |  2025-03-18 |   2001-04-02  |    8751    |
| Martin |  Vendedor |  2025-03-18 |   2001-09-28  |    8572    |
| Blake  | Directivo |  2025-03-18 |   2001-05-01  |    8722    |
| Clark  | Directivo |  2025-03-18 |   2001-06-09  |    8683    |
| Scott  |  Analista |  2025-03-18 |   2002-12-09  |    8135    |
|  King  |  Director |  2025-03-18 |   2001-11-17  |    8522    |
| Turner |  Vendedor |  2025-03-18 |   2001-09-08  |    8592    |
+--------+-----------+-------------+---------------+------------+
Truncated to displaylimit of 10.

:::{note}
La diferencia aritmética entre `CURDATE()` y la fecha de entrada devuelve un resultado anómalo. Usar en su lugar la función `DATEDIFF()`.
La función `DATEDIFF()` devuelve la diferencia en días entre dos fechas.
:::

Ejemplo. Mostrar nombre, empleo y antigüedad en días de todos los empleados.

In [202]:
%%sql
SELECT nombre, empleo, DATEDIFF(CURDATE(), fecha_entrada) AS antiguedad
FROM Empleados;

Running query in 'mysql+pymysql://example:***@mysql/example'

14 rows affected.

+--------+-----------+------------+
| nombre |   empleo  | antiguedad |
+--------+-----------+------------+
| Smith  | Ordenanza |    8857    |
| Allen  |  Vendedor |    8792    |
|  Ward  |  Vendedor |    8790    |
| Jones  | Directivo |    8751    |
| Martin |  Vendedor |    8572    |
| Blake  | Directivo |    8722    |
| Clark  | Directivo |    8683    |
| Scott  |  Analista |    8135    |
|  King  |  Director |    8522    |
| Turner |  Vendedor |    8592    |
+--------+-----------+------------+
Truncated to displaylimit of 10.

:::{note}
La función `DATE_FORMAT()` permite dar formato a un valor de tipo fecha. El formato se define en una cadena aplicando unos códigos de formato como los de la tabla siguiente.
:::

### Códigos de formato habituales para `DATEDIFF()`

| Código de formato | Descripción                          |
|--------------------|--------------------------------------|
| `%d`              | Día del mes con dos dígitos         |
| `%e`              | Día del mes                         |
| `%a`              | Nombre abreviado del día de la semana (Sun-Sat) |
| `%W`              | Nombre del día de la semana (Sunday-Saturday) |
| `%b`              | Nombre abreviado del mes (Jan-Dec)  |
| `%M`              | Nombre del mes (January-December)   |
| `%y`              | Año con dos dígitos                 |
| `%Y`              | Año con cuatro dígitos              |

Ejemplo. Mostrar el nombre, empleo y feha de entrada de todos los empleados. La fecha de entrada se presentará con el día con dos dígitos, el mes abreviado y el año con cuatro dígitos.

In [203]:
%%sql
SELECT nombre, empleo, DATE_FORMAT(fecha_entrada, '%d-%b-%Y') AS fecha_entrada
FROM Empleados;

Running query in 'mysql+pymysql://example:***@mysql/example'

14 rows affected.

+--------+-----------+---------------+
| nombre |   empleo  | fecha_entrada |
+--------+-----------+---------------+
| Smith  | Ordenanza |  17-Dec-2000  |
| Allen  |  Vendedor |  20-Feb-2001  |
|  Ward  |  Vendedor |  22-Feb-2001  |
| Jones  | Directivo |  02-Apr-2001  |
| Martin |  Vendedor |  28-Sep-2001  |
| Blake  | Directivo |  01-May-2001  |
| Clark  | Directivo |  09-Jun-2001  |
| Scott  |  Analista |  09-Dec-2002  |
|  King  |  Director |  17-Nov-2001  |
| Turner |  Vendedor |  08-Sep-2001  |
+--------+-----------+---------------+
Truncated to displaylimit of 10.

### Eliminación de duplicados

:::{note}
`DISTINCT` elimina los resultados duplicados tras la evaluación de una consulta.
:::

Ejemplo. Mostrar los diferentes empleos que tienen los empleados almacenados.

In [204]:
%%sql
SELECT DISTINCT empleo
FROM Empleados;

Running query in 'mysql+pymysql://example:***@mysql/example'

5 rows affected.

+-----------+
|   empleo  |
+-----------+
| Ordenanza |
|  Vendedor |
| Directivo |
|  Analista |
|  Director |
+-----------+

### Ordenación y limitación de resultados

:::{note}
La cláusula ORDER BY ordena los resultados de una consulta usando como criterios de ordenación la lista de columnas proporcionada.
:::

Ejemplo. Mostrar todas las filas de empleados ordenadas por sueldo

In [205]:
%%sql
SELECT *
FROM Empleados
ORDER BY sueldo;

Running query in 'mysql+pymysql://example:***@mysql/example'

14 rows affected.

+------+--------+-----------+------+---------------+--------+-------------+-----------------+
|  id  | nombre |   empleo  | jefe | fecha_entrada | sueldo | complemento | departamento_id |
+------+--------+-----------+------+---------------+--------+-------------+-----------------+
| 7369 | Smith  | Ordenanza | 7902 |   2000-12-17  | 800.0  |     None    |        20       |
| 7900 | James  | Ordenanza | 7698 |   2001-12-03  | 950.0  |     None    |        30       |
| 7876 | Adams  | Ordenanza | 7788 |   2003-01-12  | 1100.0 |     None    |        20       |
| 7521 |  Ward  |  Vendedor | 7698 |   2001-02-22  | 1250.0 |    500.0    |        30       |
| 7654 | Martin |  Vendedor | 7698 |   2001-09-28  | 1250.0 |    1400.0   |        30       |
| 7934 | Miller | Ordenanza | 7782 |   2002-01-23  | 1300.0 |     None    |        10       |
| 7844 | Turner |  Vendedor | 7698 |   2001-09-08  | 1500.0 |     0.0     |        30       |
| 7499 | Allen  |  Vendedor | 7698 |   2001-02-20  | 1600.0 |    300.0    |        30       |
| 7782 | Clark  | Directivo | 7839 |   2001-06-09  | 2450.0 |     None    |        10       |
| 7698 | Blake  | Directivo | 7839 |   2001-05-01  | 2850.0 |     None    |        30       |
+------+--------+-----------+------+---------------+--------+-------------+-----------------+
Truncated to displaylimit of 10.

Ejemplo. Mostrar todas las filas de empleados ordenados por empleo y orden decreciente de sueldo

In [206]:
%%sql
SELECT *
FROM Empleados
ORDER BY empleo, sueldo DESC;

Running query in 'mysql+pymysql://example:***@mysql/example'

14 rows affected.

+------+--------+-----------+------+---------------+--------+-------------+-----------------+
|  id  | nombre |   empleo  | jefe | fecha_entrada | sueldo | complemento | departamento_id |
+------+--------+-----------+------+---------------+--------+-------------+-----------------+
| 7788 | Scott  |  Analista | 7566 |   2002-12-09  | 3000.0 |     None    |        20       |
| 7902 |  Ford  |  Analista | 7566 |   2001-12-03  | 3000.0 |     None    |        20       |
| 7566 | Jones  | Directivo | 7839 |   2001-04-02  | 2975.0 |     None    |        20       |
| 7698 | Blake  | Directivo | 7839 |   2001-05-01  | 2850.0 |     None    |        30       |
| 7782 | Clark  | Directivo | 7839 |   2001-06-09  | 2450.0 |     None    |        10       |
| 7839 |  King  |  Director | None |   2001-11-17  | 5000.0 |     None    |        10       |
| 7934 | Miller | Ordenanza | 7782 |   2002-01-23  | 1300.0 |     None    |        10       |
| 7876 | Adams  | Ordenanza | 7788 |   2003-01-12  | 1100.0 |     None    |        20       |
| 7900 | James  | Ordenanza | 7698 |   2001-12-03  | 950.0  |     None    |        30       |
| 7369 | Smith  | Ordenanza | 7902 |   2000-12-17  | 800.0  |     None    |        20       |
+------+--------+-----------+------+---------------+--------+-------------+-----------------+
Truncated to displaylimit of 10.

:::{note}
La cláusula `LIMIT` limita el número de filas devueltas al valor especificado.
:::

Ejemplo. Mostrar las filas de los 3 empleados que tienen mayor sueldo

In [207]:
%%sql
SELECT *
FROM Empleados
ORDER BY sueldo DESC
LIMIT 3;

Running query in 'mysql+pymysql://example:***@mysql/example'

3 rows affected.

+------+--------+----------+------+---------------+--------+-------------+-----------------+
|  id  | nombre |  empleo  | jefe | fecha_entrada | sueldo | complemento | departamento_id |
+------+--------+----------+------+---------------+--------+-------------+-----------------+
| 7839 |  King  | Director | None |   2001-11-17  | 5000.0 |     None    |        10       |
| 7902 |  Ford  | Analista | 7566 |   2001-12-03  | 3000.0 |     None    |        20       |
| 7788 | Scott  | Analista | 7566 |   2002-12-09  | 3000.0 |     None    |        20       |
+------+--------+----------+------+---------------+--------+-------------+-----------------+

### Funciones de agregación

:::{note}
La función `MAX()` aplicada a una columna obtiene el valor máximo de la columna en los registros aplicados.
:::

Ejemplo. Obtener el sueldo máximo de la tabla de empleados

In [208]:
%%sql
SELECT MAX(sueldo) AS sueldo_maximo
FROM Empleados;

Running query in 'mysql+pymysql://example:***@mysql/example'

1 rows affected.

+---------------+
| sueldo_maximo |
+---------------+
|     5000.0    |
+---------------+

Ejemplo. Obtener el máximo de la combinación de sueldo y complemento de la tabla de empleados. Considerar como 0 los complementos nulos

In [209]:
%%sql
SELECT MAX(sueldo + COALESCE(complemento, 0)) AS sueldo_total_maximo
FROM Empleados;

Running query in 'mysql+pymysql://example:***@mysql/example'

1 rows affected.

+---------------------+
| sueldo_total_maximo |
+---------------------+
|        5000.0       |
+---------------------+

:::{note}
La función `MIN()` aplicada a una columna obtiene el valor mínimo de la columna en los registros aplicados.
:::

Ejemplo. Obtener la fecha de entrada más antigua

In [210]:
%%sql
SELECT MIN(fecha_entrada) AS fecha_entrada_mas_antigua
FROM Empleados;

Running query in 'mysql+pymysql://example:***@mysql/example'

1 rows affected.

+---------------------------+
| fecha_entrada_mas_antigua |
+---------------------------+
|         2000-12-17        |
+---------------------------+

Ejemplo. Obtener la fecha de entrada más antigua aplicando el formato a la fecha de día con dos dígitos, mes abreviado y año con cuatro dígitos.

In [211]:
%%sql
SELECT DATE_FORMAT(MIN(fecha_entrada), '%d-%b-%Y') AS fecha_entrada_mas_antigua
FROM Empleados;

Running query in 'mysql+pymysql://example:***@mysql/example'

1 rows affected.

+---------------------------+
| fecha_entrada_mas_antigua |
+---------------------------+
|        17-Dec-2000        |
+---------------------------+

:::{note}
La función `SUM()` aplicada a una columna obtiene la suma de los valores de la columna en los registros aplicados.
:::

Ejemplo. Obtener la suma de los sueldos dedicados a empleos de dirección.

In [212]:
%%sql
SELECT SUM(sueldo) AS suma_sueldos_direccion
FROM Empleados
WHERE empleo LIKE '%Director%';

Running query in 'mysql+pymysql://example:***@mysql/example'

1 rows affected.

+------------------------+
| suma_sueldos_direccion |
+------------------------+
|         5000.0         |
+------------------------+

:::{note}
La función `AVG()` aplicada a una columna obtiene la media de los valores numéricos de la columna en los registros aplicados.

Ejemplo. Obtener el sueldo medio del empleo Vendedor.

In [213]:
%%sql
SELECT AVG(sueldo) AS sueldo_medio_vendedor
FROM Empleados
WHERE empleo = 'Vendedor';

Running query in 'mysql+pymysql://example:***@mysql/example'

1 rows affected.

+-----------------------+
| sueldo_medio_vendedor |
+-----------------------+
|         1400.0        |
+-----------------------+

:::{note}
La función `COUNT()` aplicada a una columna obtiene la cantidad de valores no nulos en los registros aplicados. La función `COUNT(*)` devuelve la cantidad de filas del resultado.
:::

Ejemplo. Obtener la cantidad de empleados que tenemos almacenados

In [214]:
%%sql
SELECT COUNT(*) AS cantidad_empleados
FROM Empleados;

Running query in 'mysql+pymysql://example:***@mysql/example'

1 rows affected.

+--------------------+
| cantidad_empleados |
+--------------------+
|         14         |
+--------------------+

:::{note}
Al añadir `DISTINCT` a la columna a la que se aplica `COUNT()` se obtiene la cuenta de valores diferentes eliminando los duplicados.
:::

Ejemplo. Obtener el número de empleos diferentes que tienen los empleados

In [215]:
%%sql
SELECT COUNT(DISTINCT empleo) AS cantidad_empleos_diferentes
FROM Empleados;

Running query in 'mysql+pymysql://example:***@mysql/example'

1 rows affected.

+-----------------------------+
| cantidad_empleos_diferentes |
+-----------------------------+
|              5              |
+-----------------------------+

:::{note}
`COUNT (DISTINCT columna)` descarta los valores nulos.
:::

Ejemplo. Obtener la cantidad de jefes diferentes

In [216]:
%%sql
SELECT COUNT(DISTINCT jefe) AS cantidad_jefes_diferentes
FROM Empleados
WHERE jefe IS NOT NULL;

Running query in 'mysql+pymysql://example:***@mysql/example'

1 rows affected.

+---------------------------+
| cantidad_jefes_diferentes |
+---------------------------+
|             6             |
+---------------------------+

## Agregación de resultados

:::{note}
La cláusula GROUP BY crea grupos para la lista de columnas indicadas. Los grupos creados son la base a los que se les puede aplicar funciones de agregación `COUNT()`, `SUM()`, `MAX()`, `MIN()` y `AVG()`.
:::

Ejemplo. Obtener la cantidad de empleados que tiene cada empleo

In [217]:
%%sql
SELECT empleo, COUNT(*) AS cantidad_empleados
FROM Empleados
GROUP BY empleo;

Running query in 'mysql+pymysql://example:***@mysql/example'

5 rows affected.

+-----------+--------------------+
|   empleo  | cantidad_empleados |
+-----------+--------------------+
| Ordenanza |         4          |
|  Vendedor |         4          |
| Directivo |         3          |
|  Analista |         2          |
|  Director |         1          |
+-----------+--------------------+

Ejemplo. Obtener la cantidad de empleados que tiene cada empleo para los empleados cuya fecha de entrada sea el año 2001.

In [218]:
%%sql
SELECT empleo, COUNT(*) AS cantidad_empleados
FROM Empleados
WHERE YEAR(fecha_entrada) = 2001
GROUP BY empleo;

Running query in 'mysql+pymysql://example:***@mysql/example'

5 rows affected.

+-----------+--------------------+
|   empleo  | cantidad_empleados |
+-----------+--------------------+
|  Vendedor |         4          |
| Directivo |         3          |
|  Director |         1          |
| Ordenanza |         1          |
|  Analista |         1          |
+-----------+--------------------+

Ejemplo. Obtener la cantidad de empleados por año de entrada

In [219]:
%%sql
SELECT YEAR(fecha_entrada) AS anio_entrada, COUNT(*) AS cantidad_empleados
FROM Empleados
GROUP BY YEAR(fecha_entrada);

Running query in 'mysql+pymysql://example:***@mysql/example'

4 rows affected.

+--------------+--------------------+
| anio_entrada | cantidad_empleados |
+--------------+--------------------+
|     2000     |         1          |
|     2001     |         10         |
|     2002     |         2          |
|     2003     |         1          |
+--------------+--------------------+

:::{note}
La cláusula HAVING actúa como un filtro sobre los valores agregados. 
:::

Ejemplo. Obtener la cantidad de empleados por año de entrada para aquellos años que tengan más de 5 empleados.

In [220]:
%%sql
SELECT YEAR(fecha_entrada) AS anio_entrada, COUNT(*) AS cantidad_empleados
FROM Empleados
GROUP BY YEAR(fecha_entrada)
HAVING COUNT(*) > 5;

Running query in 'mysql+pymysql://example:***@mysql/example'

1 rows affected.

+--------------+--------------------+
| anio_entrada | cantidad_empleados |
+--------------+--------------------+
|     2001     |         10         |
+--------------+--------------------+

:::{note}
No confundir la cláusula `WHERE` con la cláusula `HAVING`. `WHERE` actúa como un filtro para filas previo a la agregación. `HAVING` actúa como un filtro para grupos posterior al proceso de agregación.
:::

Ejemplo. Obtener la cantidad de empleados por año de entrada considerando sólo aquellos empleados con sueldos comprendidos entre 2000 y 3000.

In [221]:
%%sql
SELECT YEAR(fecha_entrada) AS anio_entrada, COUNT(*) AS cantidad_empleados
FROM Empleados
WHERE sueldo BETWEEN 2000 AND 3000
GROUP BY YEAR(fecha_entrada);

Running query in 'mysql+pymysql://example:***@mysql/example'

2 rows affected.

+--------------+--------------------+
| anio_entrada | cantidad_empleados |
+--------------+--------------------+
|     2001     |         4          |
|     2002     |         1          |
+--------------+--------------------+

Ejemplo. Obtener la cantidad de empleados por año de entrada considerando sólo aquellos empleados con sueldos comprendidos entre 2000 y 3000. mostrar sólo los resultados de aquellos años que tuvieron más de 3 empleados.

In [222]:
%%sql
SELECT YEAR(fecha_entrada) AS anio_entrada, COUNT(*) AS cantidad_empleados
FROM Empleados
WHERE sueldo BETWEEN 2000 AND 3000
GROUP BY YEAR(fecha_entrada)
HAVING COUNT(*) > 3;

Running query in 'mysql+pymysql://example:***@mysql/example'

1 rows affected.

+--------------+--------------------+
| anio_entrada | cantidad_empleados |
+--------------+--------------------+
|     2001     |         4          |
+--------------+--------------------+

### Combinación de tablas con producto cartesiano

:::{note}
La operación de producto cartesiano (o `CROSS`JOIN`) combina todas las filas de las tablas indicadas
:::

Ejemplo. Mostrar todas las filas resultantes de combinar los empleados con los departamentos

In [223]:
%%sql
SELECT *
FROM Empleados, Departamentos;

Running query in 'mysql+pymysql://example:***@mysql/example'

56 rows affected.

+------+--------+-----------+------+---------------+--------+-------------+-----------------+------+---------------+------------+
|  id  | nombre |   empleo  | jefe | fecha_entrada | sueldo | complemento | departamento_id | id_1 |    nombre_1   |   ciudad   |
+------+--------+-----------+------+---------------+--------+-------------+-----------------+------+---------------+------------+
| 7369 | Smith  | Ordenanza | 7902 |   2000-12-17  | 800.0  |     None    |        20       |  40  |  Operaciones  |   Boston   |
| 7369 | Smith  | Ordenanza | 7902 |   2000-12-17  | 800.0  |     None    |        20       |  30  |     Ventas    |  Chicago   |
| 7369 | Smith  | Ordenanza | 7902 |   2000-12-17  | 800.0  |     None    |        20       |  20  | Investigacion |   Dallas   |
| 7369 | Smith  | Ordenanza | 7902 |   2000-12-17  | 800.0  |     None    |        20       |  10  |  Contabilidad | Nueva York |
| 7499 | Allen  |  Vendedor | 7698 |   2001-02-20  | 1600.0 |    300.0    |        30       |  40  |  Operaciones  |   Boston   |
| 7499 | Allen  |  Vendedor | 7698 |   2001-02-20  | 1600.0 |    300.0    |        30       |  30  |     Ventas    |  Chicago   |
| 7499 | Allen  |  Vendedor | 7698 |   2001-02-20  | 1600.0 |    300.0    |        30       |  20  | Investigacion |   Dallas   |
| 7499 | Allen  |  Vendedor | 7698 |   2001-02-20  | 1600.0 |    300.0    |        30       |  10  |  Contabilidad | Nueva York |
| 7521 |  Ward  |  Vendedor | 7698 |   2001-02-22  | 1250.0 |    500.0    |        30       |  40  |  Operaciones  |   Boston   |
| 7521 |  Ward  |  Vendedor | 7698 |   2001-02-22  | 1250.0 |    500.0    |        30       |  30  |     Ventas    |  Chicago   |
+------+--------+-----------+------+---------------+--------+-------------+-----------------+------+---------------+------------+
Truncated to displaylimit of 10.

:::{note}
El resultado combina cada empleado con todos los departamentos existentes, aunque no sea el departamento en que trabaja.
:::

Ejemplo. Usar `CROSS JOIN` para mostrar todas las filas resultantes de combinar los empleados con los departamentos

In [224]:
%%sql
SELECT *
FROM Empleados
CROSS JOIN Departamentos;

Running query in 'mysql+pymysql://example:***@mysql/example'

56 rows affected.

+------+--------+-----------+------+---------------+--------+-------------+-----------------+------+---------------+------------+
|  id  | nombre |   empleo  | jefe | fecha_entrada | sueldo | complemento | departamento_id | id_1 |    nombre_1   |   ciudad   |
+------+--------+-----------+------+---------------+--------+-------------+-----------------+------+---------------+------------+
| 7369 | Smith  | Ordenanza | 7902 |   2000-12-17  | 800.0  |     None    |        20       |  40  |  Operaciones  |   Boston   |
| 7369 | Smith  | Ordenanza | 7902 |   2000-12-17  | 800.0  |     None    |        20       |  30  |     Ventas    |  Chicago   |
| 7369 | Smith  | Ordenanza | 7902 |   2000-12-17  | 800.0  |     None    |        20       |  20  | Investigacion |   Dallas   |
| 7369 | Smith  | Ordenanza | 7902 |   2000-12-17  | 800.0  |     None    |        20       |  10  |  Contabilidad | Nueva York |
| 7499 | Allen  |  Vendedor | 7698 |   2001-02-20  | 1600.0 |    300.0    |        30       |  40  |  Operaciones  |   Boston   |
| 7499 | Allen  |  Vendedor | 7698 |   2001-02-20  | 1600.0 |    300.0    |        30       |  30  |     Ventas    |  Chicago   |
| 7499 | Allen  |  Vendedor | 7698 |   2001-02-20  | 1600.0 |    300.0    |        30       |  20  | Investigacion |   Dallas   |
| 7499 | Allen  |  Vendedor | 7698 |   2001-02-20  | 1600.0 |    300.0    |        30       |  10  |  Contabilidad | Nueva York |
| 7521 |  Ward  |  Vendedor | 7698 |   2001-02-22  | 1250.0 |    500.0    |        30       |  40  |  Operaciones  |   Boston   |
| 7521 |  Ward  |  Vendedor | 7698 |   2001-02-22  | 1250.0 |    500.0    |        30       |  30  |     Ventas    |  Chicago   |
+------+--------+-----------+------+---------------+--------+-------------+-----------------+------+---------------+------------+
Truncated to displaylimit of 10.

:::{note}
La eliminación de las filas que combinan los empleados con departamentos en los que no trabajan se puede realizar aplicando un filtro que seleccione sólo las filas en que coincidan el número de departamento en el que trabajan los empleados con el número de los departamentos.
:::

Ejemplo. Mostrar las filas resultantes de combinar los empleados con los departamentos en los que trabaja cada uno de ellos.

In [225]:
%%sql
SELECT *
FROM Empleados, Departamentos
WHERE Empleados.departamento_id = Departamentos.id;

Running query in 'mysql+pymysql://example:***@mysql/example'

14 rows affected.

+------+--------+-----------+------+---------------+--------+-------------+-----------------+------+---------------+------------+
|  id  | nombre |   empleo  | jefe | fecha_entrada | sueldo | complemento | departamento_id | id_1 |    nombre_1   |   ciudad   |
+------+--------+-----------+------+---------------+--------+-------------+-----------------+------+---------------+------------+
| 7782 | Clark  | Directivo | 7839 |   2001-06-09  | 2450.0 |     None    |        10       |  10  |  Contabilidad | Nueva York |
| 7839 |  King  |  Director | None |   2001-11-17  | 5000.0 |     None    |        10       |  10  |  Contabilidad | Nueva York |
| 7934 | Miller | Ordenanza | 7782 |   2002-01-23  | 1300.0 |     None    |        10       |  10  |  Contabilidad | Nueva York |
| 7369 | Smith  | Ordenanza | 7902 |   2000-12-17  | 800.0  |     None    |        20       |  20  | Investigacion |   Dallas   |
| 7566 | Jones  | Directivo | 7839 |   2001-04-02  | 2975.0 |     None    |        20       |  20  | Investigacion |   Dallas   |
| 7788 | Scott  |  Analista | 7566 |   2002-12-09  | 3000.0 |     None    |        20       |  20  | Investigacion |   Dallas   |
| 7876 | Adams  | Ordenanza | 7788 |   2003-01-12  | 1100.0 |     None    |        20       |  20  | Investigacion |   Dallas   |
| 7902 |  Ford  |  Analista | 7566 |   2001-12-03  | 3000.0 |     None    |        20       |  20  | Investigacion |   Dallas   |
| 7499 | Allen  |  Vendedor | 7698 |   2001-02-20  | 1600.0 |    300.0    |        30       |  30  |     Ventas    |  Chicago   |
| 7521 |  Ward  |  Vendedor | 7698 |   2001-02-22  | 1250.0 |    500.0    |        30       |  30  |     Ventas    |  Chicago   |
+------+--------+-----------+------+---------------+--------+-------------+-----------------+------+---------------+------------+
Truncated to displaylimit of 10.

Ejemplo. Mostrar las filas resultantes de combinar el departamento de Ventas con sus empleados.

In [226]:
%%sql
SELECT *
FROM Empleados, Departamentos
WHERE Empleados.departamento_id = Departamentos.id
AND Departamentos.nombre = 'Ventas';

Running query in 'mysql+pymysql://example:***@mysql/example'

6 rows affected.

+------+--------+-----------+------+---------------+--------+-------------+-----------------+------+----------+---------+
|  id  | nombre |   empleo  | jefe | fecha_entrada | sueldo | complemento | departamento_id | id_1 | nombre_1 |  ciudad |
+------+--------+-----------+------+---------------+--------+-------------+-----------------+------+----------+---------+
| 7499 | Allen  |  Vendedor | 7698 |   2001-02-20  | 1600.0 |    300.0    |        30       |  30  |  Ventas  | Chicago |
| 7521 |  Ward  |  Vendedor | 7698 |   2001-02-22  | 1250.0 |    500.0    |        30       |  30  |  Ventas  | Chicago |
| 7654 | Martin |  Vendedor | 7698 |   2001-09-28  | 1250.0 |    1400.0   |        30       |  30  |  Ventas  | Chicago |
| 7698 | Blake  | Directivo | 7839 |   2001-05-01  | 2850.0 |     None    |        30       |  30  |  Ventas  | Chicago |
| 7844 | Turner |  Vendedor | 7698 |   2001-09-08  | 1500.0 |     0.0     |        30       |  30  |  Ventas  | Chicago |
| 7900 | James  | Ordenanza | 7698 |   2001-12-03  | 950.0  |     None    |        30       |  30  |  Ventas  | Chicago |
+------+--------+-----------+------+---------------+--------+-------------+-----------------+------+----------+---------+

Ejemplo. Obtener la cantidad de empleados que hay en el departamento de Ventas agrupados por el tipo de empleo.

In [227]:
%%sql
SELECT empleo, COUNT(*) AS cantidad_empleados
FROM Empleados, Departamentos
WHERE Empleados.departamento_id = Departamentos.id
AND Departamentos.nombre = 'Ventas'
GROUP BY empleo;

Running query in 'mysql+pymysql://example:***@mysql/example'

3 rows affected.

+-----------+--------------------+
|   empleo  | cantidad_empleados |
+-----------+--------------------+
|  Vendedor |         4          |
| Directivo |         1          |
| Ordenanza |         1          |
+-----------+--------------------+

Ejemplo. Obtener para las ciudades de Dallas y Chicago la cantidad de empleados y su sueldo medio.

In [228]:
%%sql
SELECT Departamentos.ciudad, COUNT(*) AS cantidad_empleados, AVG(Empleados.sueldo) AS sueldo_medio
FROM Empleados, Departamentos
WHERE Empleados.departamento_id = Departamentos.id
AND Departamentos.ciudad IN ('Dallas', 'Chicago')
GROUP BY Departamentos.ciudad;

Running query in 'mysql+pymysql://example:***@mysql/example'

2 rows affected.

+---------+--------------------+--------------------+
|  ciudad | cantidad_empleados |    sueldo_medio    |
+---------+--------------------+--------------------+
|  Dallas |         5          |       2175.0       |
| Chicago |         6          | 1566.6666666666667 |
+---------+--------------------+--------------------+

Ejemplo. Obtener el sueldo medio por ciudades para aquellos casos que tengan un sueldo medio superior a 2000.

In [229]:
%%sql
SELECT Departamentos.ciudad, AVG(Empleados.sueldo) AS sueldo_medio
FROM Empleados, Departamentos
WHERE Empleados.departamento_id = Departamentos.id
GROUP BY Departamentos.ciudad
HAVING AVG(Empleados.sueldo) > 2000;

Running query in 'mysql+pymysql://example:***@mysql/example'

2 rows affected.

+------------+--------------------+
|   ciudad   |    sueldo_medio    |
+------------+--------------------+
| Nueva York | 2916.6666666666665 |
|   Dallas   |       2175.0       |
+------------+--------------------+

### Combinación de tablas con INNER JOIN

:::{note}
El operador `INNER JOIN` combina en una única operación el producto cartesiano y el filtrado de filas con el criterio indicado. La condición de filtrado pasa de la cláusula `WHERE` a la cláusula `FROM` sacando de la cláusula `WHERE` las _condiciones de join_.
:::

Ejemplo. Usar el operador INNER JOIN para mostrar todas las columnas de empleado junto al nombre del departamento en que trabajan para aquellos empleados que trabajan en el departamento de Ventas.

In [230]:
%%sql
SELECT Empleados.*, Departamentos.nombre AS nombre_departamento
FROM Empleados
INNER JOIN Departamentos ON Empleados.departamento_id = Departamentos.id
WHERE Departamentos.nombre = 'Ventas';

Running query in 'mysql+pymysql://example:***@mysql/example'

6 rows affected.

+------+--------+-----------+------+---------------+--------+-------------+-----------------+---------------------+
|  id  | nombre |   empleo  | jefe | fecha_entrada | sueldo | complemento | departamento_id | nombre_departamento |
+------+--------+-----------+------+---------------+--------+-------------+-----------------+---------------------+
| 7499 | Allen  |  Vendedor | 7698 |   2001-02-20  | 1600.0 |    300.0    |        30       |        Ventas       |
| 7521 |  Ward  |  Vendedor | 7698 |   2001-02-22  | 1250.0 |    500.0    |        30       |        Ventas       |
| 7654 | Martin |  Vendedor | 7698 |   2001-09-28  | 1250.0 |    1400.0   |        30       |        Ventas       |
| 7698 | Blake  | Directivo | 7839 |   2001-05-01  | 2850.0 |     None    |        30       |        Ventas       |
| 7844 | Turner |  Vendedor | 7698 |   2001-09-08  | 1500.0 |     0.0     |        30       |        Ventas       |
| 7900 | James  | Ordenanza | 7698 |   2001-12-03  | 950.0  |     None    |        30       |        Ventas       |
+------+--------+-----------+------+---------------+--------+-------------+-----------------+---------------------+

### Combinación de tablas con LEFT JOIN

:::{note}
El operador `LEFT JOIN` relaja al operador `INNER JOIN` mostrando en los resultados todas las filas de la tabla que aparece a la izquierda del `LEFT JOIN`. Si hay valores con los que combinar mostrará los valores. Si no hay valores, completará el resultado con valores `NULL`.
:::

Ejemplo. Obtener la cantidad de empleados que tiene cada departamento.

In [231]:
%%sql
SELECT Departamentos.nombre, COUNT(Empleados.id) AS cantidad_empleados
FROM Departamentos
LEFT JOIN Empleados ON Departamentos.id = Empleados.departamento_id
GROUP BY Departamentos.nombre;

Running query in 'mysql+pymysql://example:***@mysql/example'

4 rows affected.

+---------------+--------------------+
|     nombre    | cantidad_empleados |
+---------------+--------------------+
|  Contabilidad |         3          |
| Investigacion |         5          |
|     Ventas    |         6          |
|  Operaciones  |         0          |
+---------------+--------------------+

:::{note}
Si se realiza la combinación de tablas con el operador `INNER JOIN` se perdería el departamento de Operaciones.
:::

Ejemplo. Obtener la cantidad de empleados que tiene cada departamento usando `INNER JOIN`

In [232]:
%%sql
SELECT Departamentos.nombre, COUNT(Empleados.id) AS cantidad_empleados
FROM Departamentos
INNER JOIN Empleados ON Departamentos.id = Empleados.departamento_id
GROUP BY Departamentos.nombre;

Running query in 'mysql+pymysql://example:***@mysql/example'

3 rows affected.

+---------------+--------------------+
|     nombre    | cantidad_empleados |
+---------------+--------------------+
|  Contabilidad |         3          |
| Investigacion |         5          |
|     Ventas    |         6          |
+---------------+--------------------+

## Uso de alias para tablas

:::{note}
Es posible utilizar un nuevo nombre (o alias) para una tabla involucrada en una consulta. Un caso habitual de uso de los alias es para usar un nombre abreviado para las tablas.
:::

Ejemplo. Obtener la cantidad de empleados por nombre de departamento

In [233]:
%%sql
SELECT D.nombre, COUNT(E.id) AS cantidad_empleados
FROM Departamentos D
LEFT JOIN Empleados E ON D.id = E.departamento_id
GROUP BY D.nombre;

Running query in 'mysql+pymysql://example:***@mysql/example'

4 rows affected.

+---------------+--------------------+
|     nombre    | cantidad_empleados |
+---------------+--------------------+
|  Contabilidad |         3          |
| Investigacion |         5          |
|     Ventas    |         6          |
|  Operaciones  |         0          |
+---------------+--------------------+

:::{note}
El uso de alias hace que la tabla a la que se le ha aplicado el alias pase a ser denominada con el nombre del alias. El uso del nombre anterior produciría un error.
:::

## Subconsultas

:::{note}
Los resultados que devuelve una consulta pueden ser usados para evaluar las condiciones de otras consultas. Esto se consigue anidando consultas. Las consultas internas se denominan subconsultas, que son evaluadas en primer lugar ofreciendo sus valores a las consultas exteriores.
:::

Ejemplo. Obtener nombre y sueldo de los empleados que tienen un sueldo superior al sueldo del empleado Allen.

In [234]:
%%sql
SELECT nombre, sueldo
FROM Empleados
WHERE sueldo > (SELECT sueldo FROM Empleados WHERE nombre = 'Allen');

Running query in 'mysql+pymysql://example:***@mysql/example'

6 rows affected.

+--------+--------+
| nombre | sueldo |
+--------+--------+
| Jones  | 2975.0 |
| Blake  | 2850.0 |
| Clark  | 2450.0 |
| Scott  | 3000.0 |
|  King  | 5000.0 |
|  Ford  | 3000.0 |
+--------+--------+

Ejemplo. Obtener nombre y sueldo de los empleados que tienen un sueldo superior al sueldo máximo de los empleados con empleo Vendedor.

In [236]:
%%sql
SELECT nombre, sueldo
FROM Empleados
WHERE sueldo > (SELECT MAX(sueldo) FROM Empleados WHERE empleo = 'Vendedor');

Running query in 'mysql+pymysql://example:***@mysql/example'

6 rows affected.

+--------+--------+
| nombre | sueldo |
+--------+--------+
| Jones  | 2975.0 |
| Blake  | 2850.0 |
| Clark  | 2450.0 |
| Scott  | 3000.0 |
|  King  | 5000.0 |
|  Ford  | 3000.0 |
+--------+--------+

### Los operadores ALL y ANY

:::{note}
`ALL` se evalua como verdadero cuando se cumple para todos los valores afectados. `ANY` se evalua como verdadero cuando se cumple para alguno de los valores afectados.
:::

Ejemplo. Obtener nombre y sueldo de los empleados que tienen un sueldo superior al sueldo de todos los empleados con empleo Vendedor.

In [239]:
%%sql
SELECT nombre, sueldo
FROM Empleados
WHERE sueldo > ALL (SELECT sueldo FROM Empleados WHERE empleo = 'Vendedor');

Running query in 'mysql+pymysql://example:***@mysql/example'

6 rows affected.

+--------+--------+
| nombre | sueldo |
+--------+--------+
| Jones  | 2975.0 |
| Blake  | 2850.0 |
| Clark  | 2450.0 |
| Scott  | 3000.0 |
|  King  | 5000.0 |
|  Ford  | 3000.0 |
+--------+--------+

Ejemplo. Obtener nombre y sueldo de los empleados que tienen un sueldo superior al sueldo de alguno de los empleados con empleo Vendedor.

In [241]:
%%sql
SELECT nombre, sueldo
FROM Empleados
WHERE sueldo > ANY (SELECT sueldo FROM Empleados WHERE empleo = 'Vendedor');

Running query in 'mysql+pymysql://example:***@mysql/example'

9 rows affected.

+--------+--------+
| nombre | sueldo |
+--------+--------+
| Allen  | 1600.0 |
| Jones  | 2975.0 |
| Blake  | 2850.0 |
| Clark  | 2450.0 |
| Scott  | 3000.0 |
|  King  | 5000.0 |
| Turner | 1500.0 |
|  Ford  | 3000.0 |
| Miller | 1300.0 |
+--------+--------+

### Subconsultas en FROM

:::{note}
Un uso más avanzado de las subconsultas consiste en la creación de una consulta en la cláusula `FROM`. La subconsulta recibirá un nombre provisional que podrá ser utilizado en la consulta externa como si de una tabla existente se tratase.
:::

Ejemplo. Mostrar para cada número de departamento el nombre, empleo y sueldo del empleado con mayor sueldo.

In [242]:
%%sql
SELECT departamento_id, nombre, empleo, sueldo
FROM (SELECT departamento_id, nombre, empleo, sueldo, ROW_NUMBER() OVER (PARTITION BY departamento_id ORDER BY sueldo DESC) AS rn
      FROM Empleados) AS sub
WHERE rn = 1;

Running query in 'mysql+pymysql://example:***@mysql/example'

3 rows affected.

+-----------------+--------+-----------+--------+
| departamento_id | nombre |   empleo  | sueldo |
+-----------------+--------+-----------+--------+
|        10       |  King  |  Director | 5000.0 |
|        20       | Scott  |  Analista | 3000.0 |
|        30       | Blake  | Directivo | 2850.0 |
+-----------------+--------+-----------+--------+

## Inserción, modificación y eliminación de registros

### Uso básico de INSERT (Introducción de todos los valores)

```sql
INSERT INTO tabla
VALUES(valor columna 1, ..., valor columna n)
```

Ejemplo. Insertar tres empleados en el departamento 40. Uno de ellos es el jefe de los otros dos y no tendrá complemento.

In [ ]:
%%sql
INSERT INTO Empleados (id, nombre, empleo, sueldo, complemento, departamento_id, jefe)
VALUES (8001, 'Juan', 'Jefe', 3000, NULL, 40, NULL),
       (8002, 'Ana', 'Empleado', 2000, 200, 40, 8001),
       (8003, 'Luis', 'Empleado', 1800, 150, 40, 8001);

Running query in 'mysql+pymysql://example:***@mysql/example'

3 rows affected.

++
||
++
++

Ejemplo. Mostrar los registros de los empleados del departamento Operaciones para comprobar el resultado de las 3 inserciones.

In [244]:
%%sql
SELECT *
FROM Empleados
WHERE departamento_id = 40;

Running query in 'mysql+pymysql://example:***@mysql/example'

3 rows affected.

+------+--------+----------+------+---------------+--------+-------------+-----------------+
|  id  | nombre |  empleo  | jefe | fecha_entrada | sueldo | complemento | departamento_id |
+------+--------+----------+------+---------------+--------+-------------+-----------------+
| 8001 |  Juan  |   Jefe   | None |      None     | 3000.0 |     None    |        40       |
| 8002 |  Ana   | Empleado | 8001 |      None     | 2000.0 |    200.0    |        40       |
| 8003 |  Luis  | Empleado | 8001 |      None     | 1800.0 |    150.0    |        40       |
+------+--------+----------+------+---------------+--------+-------------+-----------------+

### Uso de INSERT para añadir filas incompletas (No se introducen todos los valores)

```sql
INSERT INTO tabla(columna1, ..., columna m)
VALUES(valor columna 1, ..., valor columna m)
```

Ejemplo. Insertar un empleado en el departamento 40 omitiendo la columna complemento.

In [245]:
%%sql
INSERT INTO Empleados (id, nombre, empleo, sueldo, departamento_id, jefe)
VALUES (8004, 'Carlos', 'Empleado', 1900, 40, 8001);

Running query in 'mysql+pymysql://example:***@mysql/example'

1 rows affected.

++
||
++
++

### Actualización de registros con UPDATE

```sql
UPDATE tabla
SET campo 1 = valor 1, ..., campo n = valor n
WHERE condicion
```

Ejemplo. Actualizar a 120 el valor del complemento del empleado con numero 8003

In [246]:
%%sql
UPDATE Empleados
SET complemento = 120
WHERE id = 8003;

Running query in 'mysql+pymysql://example:***@mysql/example'

1 rows affected.

++
||
++
++

Ejemplo. Empleados del departamento de Operaciones tras la actualización del complemento del empleado 8003.

In [247]:
%%sql
SELECT *
FROM Empleados
WHERE departamento_id = 40;

Running query in 'mysql+pymysql://example:***@mysql/example'

4 rows affected.

+------+--------+----------+------+---------------+--------+-------------+-----------------+
|  id  | nombre |  empleo  | jefe | fecha_entrada | sueldo | complemento | departamento_id |
+------+--------+----------+------+---------------+--------+-------------+-----------------+
| 8001 |  Juan  |   Jefe   | None |      None     | 3000.0 |     None    |        40       |
| 8002 |  Ana   | Empleado | 8001 |      None     | 2000.0 |    200.0    |        40       |
| 8003 |  Luis  | Empleado | 8001 |      None     | 1800.0 |    120.0    |        40       |
| 8004 | Carlos | Empleado | 8001 |      None     | 1900.0 |     None    |        40       |
+------+--------+----------+------+---------------+--------+-------------+-----------------+

### Eliminación de registros con DELETE

```sql
DELETE
FROM tabla
WHERE condicion
```

Ejemplo. Eliminar el empleado con número 8003

In [248]:
%%sql
DELETE FROM Empleados
WHERE id = 8003;

Running query in 'mysql+pymysql://example:***@mysql/example'

1 rows affected.

++
||
++
++

Ejemplo. Eliminar todos los emepleados del departamento Operaciones

In [249]:
%%sql
DELETE FROM Empleados
WHERE departamento_id = 40;

Running query in 'mysql+pymysql://example:***@mysql/example'

3 rows affected.

++
||
++
++

## Vistas

* Se definen mediante una expresión SQL que recupera su contenido.
* Su contenido se obtiene bajo demanda evaluando la expresión SQL que las define
* Se definen a partir de tablas u otras vistas existentes
* Se pueden considerar tablas virtuales. No almacenan datos. 

```sql
CREATE VIEW AS 
expresion SELECT
```

**Uso de las vistas**

* Personalización de datos
* Mecanismo de seguridad. Se da acceso a vistas y no a las tablas base
* Simplificación de consultas

Ejemplo Crear una vista que combine cada departamento con los datos de sus empleados. Si no hay datos de empleados, completar con `NULL`

In [250]:
%%sql
CREATE VIEW Vista_Empleados_Departamentos AS
SELECT D.nombre AS nombre_departamento, E.*
FROM Departamentos D
LEFT JOIN Empleados E ON D.id = E.departamento_id;

Running query in 'mysql+pymysql://example:***@mysql/example'

++
||
++
++

Ejemplo. Usar la vista anterior para obtener el sueldo máximo para cada departamento

In [251]:
%%sql
SELECT nombre_departamento, MAX(sueldo) AS sueldo_maximo
FROM Vista_Empleados_Departamentos
GROUP BY nombre_departamento;

Running query in 'mysql+pymysql://example:***@mysql/example'

4 rows affected.

+---------------------+---------------+
| nombre_departamento | sueldo_maximo |
+---------------------+---------------+
|     Contabilidad    |     5000.0    |
|    Investigacion    |     3000.0    |
|        Ventas       |     2850.0    |
|     Operaciones     |      None     |
+---------------------+---------------+